[
  {   
    "invocationName":"Blinding Flash",
    "level":1,
    "cost":"1",
    "range":"60 feet",
    "duration":"Instant",
    "source":"Rifts Ultimate Edition",
    "page":198,
    "type":"",
    "usage":["Buff.png"],
	"save":"standard, -1 if 3 PPE are pumped into the spell",
	"description":"This invocation creates a sudden burst of intense, white light, temporarily blinding everyone in its ten food radius. Victims are blinded for one to four melee rounds, and are -10 to strike, parry, and dodge. The chance of falling is 01-50% every 10 feel. The magic can be cast up to 60 feet away. Saving throw is standard; those who successfully save vs magic are not blinded. NOTE: Does not affect robotic, bionic, or cybernetic eyes."
  },
  {
    "invocationName":"Cloud of Smoke",
    "level":1,
    "cost":"1",
    "range":"90 feet",
    "duration":"4 melees (one minute) PLE",
    "source":"Rifts Ultimate Edition",
    "page":198,
    "type":"",
    "usage1":["Debuff.png", "Utility.png"],
	"save":"None",
	"description":"This magic enables the mage to create a cloud of dense, black smoke (30x30x30 feet maximum size) up to ninety feet away. Victims caught in the cloud will be unable to see anything beyond the cloud, and their impaired vision allows them to see no more than three feet within the cloud, and even then that means only blurry shapes. While in the cloud, victims are -5 to strike, parry, dodge, disarm, and entangle."
  },
  {
    "invocationName":"Death Trance",
    "level":1,
    "cost":"1",
    "range":"self only",
    "duration":"10 melee rounds (two and a half minutes) PLE.",
    "source":"Rifts Ultimate Edition",
    "page":198,
    "type":"",
    "usage:["Utility.png"],
	"save":"None",
	"description":"A magically induced trance which makes the spell caster appear to be dead. There is no breathing, pulse, heartbeat, or any other signs of life. While in the trance, the mage is quite helpless, unable to speak, move or invoke magic. Only minor physical sensations felt by the character are recognizable, like being jostled, carried or hearing voices, but no specific identification or memories are possible. The magic can be cancelled at will at any time."
  },
  {
    "invocationName":"Globe of Daylight",
    "level":1,
    "cost":"2",
    "range":"30 feet",
    "duration":"12 melees (3 minutes) PLE",
    "source":"Rifts Ultimate Edition",
    "page":198,
    "type":"",
    "usage":[Utility.png],
	"save":"None",
	"description":"A small globe or sphere of true daylight is magically created. The light is bright enough to light up a 12 foot area per each level of its creator's experience. Because it is daylight, it can word off vampires and most other types of undead and demons who fear or are hurt by sunlight, keeping them at bay just beyond the edge of the light. The creator of the globe can mentally move it along with himself, or send it up to thirty feed ahead. The maximum speed at which the globe can travel is equal to a speed attribute of 12."
  },
  {
    "invocationName":"Lantern Light",
    "level":1,
    "cost":"1",
    "range":"10 feet",
    "duration":"30 minutes PLE",
    "source":"Rifts Ultimate Edition",
    "page":198,
    "type":"",
    "usage":[Utility.png],
	"save":"None",
	"description":"The Lantern Light spell creates a small sphere of light that is less brilliant but longer lasting than the Globe of Daylight. It floats within 10 feel of the spell caster and can be mentally moved to hover at different angles and positions as the mage desires. This magic light may be thought of as a magical floating lantern or light bulb with a dimmer switch. The intensity of the light can be mentally adjusted to the equivalent of a 50 to 300 watt light bulb, whatever suits its creator. NOTE: This is not sunlight, so it will not damage vampires nor keep them at bay."
  },
  {
    "invocationName":"See Aura",
    "level":1,
    "cost":"6",
    "range":"100 feet",
    "duration":"one melee",
    "source":"Rifts Ultimate Edition",
    "page":199,
    "type":"",
    "usage":["Utility.png"],
	"save":"None",
	"description":"All things, organic and inorganic, have an aura. The aura has many features and distinctions, and can be used to see or sense things invisible to the eye. Seeing an aura will indicate the following:
	* Estimate the general level of experience. Low (1-3), medium (4-7), high (8th and up).
	* The presence of magic (no indication of what, or power level)
	* The presence of psychic abilities. Low (Minor) or high (Major or Master). 
	* High or Low base P.P.E.
	* The presence of a possessing entity (does not indicate Psychic Possession or mind control. 
	* Health. Sick, injured or completely well. 
	* The presence of an unusual human aberration which indicates a serious illness or that the character is not human and may be a mutant, D-Bee, or demon, but does not reveal which. 
 	NOTE: One can not use this spell to determine another character's alignment."
  },
  {
    "invocationName":"See The Invisible",
    "level":1,
    "cost":"4",
    "range":"200 feet",
    "duration":"1 minute PLE",
    "source":"Rifts Ultimate Edition",
    "page":199,
    "type":"",
    "usage":["Utility.png"],
	"save":"None",
	"description":"The character can see forces, objects, and creatures which can turn invisible or are naturally invisible. Even if the creature has no form per se, the mystic will be able to discern the vaporous image or energy sphere which is the being. This includes ghosts, entities, and the astral body."
  },
  {
    "invocationName":"Sense Evil",
    "level":1,
    "cost":"2",
    "range":"90 feet",
    "duration":"2 minutes PLE",
    "source":"Rifts Ultimate Edition",
    "page":199,
    "type":"",
    "usage":["Utility.png"],
	"save":"None, except a psychic mind block or a protection from a magic pentacle which will prevent the spell from working on anyone in the circle. The psychic's equivalent power of sense evil is not blocked by the magic pentacle.",
	"description":"The sense evil invocation will enable its spell caster to feel or sense the presence of supernatural evil. It will indicate approximately how many supernatural evil presences are within the 90 ft. area. It can also register the intensity of the evil and pinpoint the general location of the source(s) to a particular room(s), possessed object or person, or an approximate distance.
Evil emanations from human beings are much less distinct, and cannot be sensed unless the source/person has an immediate evil intention."
  },
  {
    "invocationName":"Sense Magic",
    "level":1,
    "cost":"4",
    "range":"120 feet",
    "duration":"2 minutes PLE",
    "source":"Rifts Ultimate Edition",
    "page":199,
    "type":"",
    "usage":["Buff.png", "Offensive.png", "Utility.png"],
	"save":"None",
	"description":"This magic ability enables the character to sense or feel the presence of magic. Like a Geiger counter, the individual can tell if he is near (within 20 ft.) or far from the magic. The ability can also indicate whether a person or object is enchanted/under a magic spell (this does not include psychic powers), is in the process of invoking magic, or if magic is being used in the range area. Note: Practitioners of magic and most supernatural creatures do not register as magic except when actually casting a spell/using magic."
  },
  {
    "invocationName":"Thunderclap",
    "level":1,
    "cost":"4",
    "range":"Directly affects the immediate area (30 ft. radius), but can be heard up to one mile away.",
    "duration":"Instant",
    "source":"Rifts Ultimate Edition",
    "page":199,
    "type":"",
    "usage":["Buff.png", "Offensive.png", "Utility.png"],
	"save":"Save vs. Horror Factor",
	"description":"The invocation produces a booming clap of thunder that is so loud that it seems to make the air vibrate. A thunderclap is an excellent means of alerting or signalling allies, as well as a means of intimidation. As an intimidation device, it will momentarily startle and distract everyone other than the spell caster. This provides the creator of the thunder with a bonus of +5 on his initiative, +1 to strike, parry, and dodge, and creates a horror factor of 8. All characters within the 30 foot radius must roll to save vs. Horror Factor, except the mage who cast the spell."
  },
  {
    "invocationName":"Befuddle",
    "level":2,
    "cost":"6",
    "range":"100 feet",
    "duration":"2 minutes PLE",
    "source":"Rifts Ultimate Edition",
    "page":199,
    "type":"",
    "usage":["Debuff.png"],
	"save":"Standard",
	"description":"An enchantment that temporarily causes its victim to become confused and disoriented. Concentration and reactions are impaired. Those affected are -2 to strike, parry, and dodge, actions per melee are reduced by one-half, and all skills suffer a penalty of -20%. Each invocation affects only one person each time it is cast. A successful save vs. magic means the intended victim suffers no impairment."
  },
  {
    "invocationName":"Chameleon",
    "level":2,
    "cost":"6",
    "range":"Self",
    "duration":"18 Melees PLE",
    "source":"Rifts Ultimate Edition",
    "page":199,
    "type":"",
    "usage":["Buff.png"],
	"save":"None",
	"description":" This spell enables the affected person to seemingly alter the color and pattern of his clothes and physical body, enabling him to blend into the surrounding environment. Movement destroys the effectiveness of this magic.

    90% undetectable if not moving
    70% undetectable if moving 2 feet per melee or slower
    20% undetectable if moving 6 feet per melee
    Totally ineffective if moving any faster 

One final note, for those who are wondering. Yes, this spell, unlike a true chameleon, can do plaid. :)"
  },
  {
    "invocationName":"Cleanse",
    "level":2,
    "cost":"6",
    "range":"10 feet",
    "duration":"Instant",
    "source":"Rifts Ultimate Edition",
    "page":200,
    "type":"",
    "usage":["Utility.png"],
	"save":"",
	"description":""
  },
  {
    "invocationName":"Climb",
    "level":2,
    "cost":"3",
    "range":"Self or others up to 40 ft. away",
    "duration":"5 minutes PLE",
    "source":"Rifts Ultimate Edition",
    "page":200,
    "type":"",
    "usage":["Buff.png", "Utility.png"],
	"save":"None",
	"description":"This enchantment enables the enchanted person to climb with exceptional, almost inhuman skill, speed, and agility. Skill level is 98% for normal rough, climbable surfaces; speed is equal to the speed attribute. Smooth, presumably unclimbable, or extremely difficult surfaces to climb can normally be scaled with a skill level of 60%. Rappelling is included."
  },
  {
    "invocationName":"Cloak of Darkness",
    "level":2,
    "cost":"6",
    "range":"5 feet",
    "duration":"4 minutes",
    "source":"Rifts Ultimate Edition",
    "page":200,
    "type":"",
    "usage":["Buff.png", "Utility.png"],
	"save":"",
	"description":""
  },
  {
    "invocationName":"Concealment",
    "level":2,
    "cost":"6",
    "range":"Small objects up to 40 feet away",
    "duration":"5 minutes PLE",
    "source":"Rifts Ultimate Edition",
    "page":200,
    "type":"",
    "usage":["Utility.png"],
	"save":"Standard",
	"description":"This magic makes any small object sort of invisible. Actually, it affects the perception of anybody who looks at it. Unless the person makes a successful saving throw, the item cannot be seen. This can be applied to an object on one's person or out in the open. Only one object is affected each time the spell is cast. The object cannot be living and must be smaller than 14 inches in length and height, 6 inches in width, and weight 14 pounds or less. Each person who looks at the item must roll a saving throw vs. magic. Note: if the object is used as a weapon, or picked up, the enchantment is broken."
  },
  {
    "invocationName":"Detect Concealment",
    "level":2,
    "cost":"6",
    "range":"Area effect: 30 feet",
    "duration":"Instant",
    "source":"Rifts Ultimate Edition",
    "page":200,
    "type":"",
    "usage":["Utility.png"],
	"save":"None",
	"description":"A magic that will instantly negate any concealment spells and reveal any object or person which may have been mystically concealed. Can be directed at a specific area or individual, or made to affect an entire area of 30 ft. "
  },
  {
    "invocationName":"Extinguish Fire",
    "level":2,
    "cost":"4",
    "range":"20 feet area up to 80 feet away",
    "duration":"1 minute PLE",
    "source":"Rifts Ultimate Edition",
    "page":200,
    "type":"",
    "usage":["Utility.png"],
	"save":"None",
	"description":"The mage can instantly put out up to a 20 ft. area of fire 80 ft. away. A total of 40 ft. can be extinguished every 15 seconds/one melee."
  },
  {
    "invocationName":"Fear",
    "level":2,
    "cost":"5",
    "range":"20 feet area up to 100 feet away",
    "duration":"1 minutes",
    "source":"Rifts Ultimate Edition",
    "page":200,
    "type":"",
    "usage":["Debuff.png"],
	"save":"Save vs Horror Factor",
	"description":"The invocation creates a sensation of fear over a particular area. The mystic can place the enchantment on an area occupied with people, or an area that is not presently occupied. Anybody entering the area of enchantment must roll to save vs. a Horror Factor of 16. Effects on anyone who fails the Horror Factor save are normal for a HF roll."
  },
  {
    "invocationName":"Heavy Breathing",
    "level":2,
    "cost":"5",
    "range":"60 feet",
    "duration":"5 melees PLE",
    "source":"Rifts Ultimate Edition",
    "page":201,
    "type":"",
    "usage":["Debuff.png"],
	"save":"Standard",
	"description":"The mage is able to conjure a mysterious, frightful sound of heavy, labored breathing, as if something invisible was lurking about. The mage can mentally manipulate the sound, increasing or decreasing the breathing rhythm, and move the sound around up to 60 feet away. The breathing can be heard in a six foot radius. Those hearing the breathing will become fearful and panicky. There is a 60% chance that the frightened fellow(s) will flee in terror. Those who hear the breathing and do not run will be -2 to strike, and -1 to parry and dodge as they shake in their boots."
  },
  {
    "invocationName":"Levitation",
    "level":2,
    "cost":"5",
    "range":"Up to 60 feet away",
    "duration":"3 minutes PLE",
    "source":"Rifts Ultimate Edition",
    "page":201,
    "type":"",
    "usage":["Utility.png"],
	"save":"Standard",
	"description":"Magic levitation enables the invoker of the magic to raise himself, or other people, or an object straight up into the air and suspend it there. Movement is limited to straight up and down, no horizontal motion is possible. Weight is restricted to 200 lbs., plus 20 lbs. per level of experience. Unwilling victims of the magic get a saving throw; those who are successful in the saving throw remain unmoved. Maximum height is typically 60 ft. plus 10 ft. per level of experience. Targets affected can be up to 60 ft. away."
  },
  {
    "invocationName":"Manipulate Objects",
    "level":2,
    "cost":"2",
    "range":"50 feet",
    "duration":"2 minutes",
    "source":"Rifts Ultimate Edition",
    "page":201,
    "type":"",
    "usage":["Utility.png"],
	"save":"",
	"description":""
  },
  {
    "invocationName":"Turn Dead",
    "level":2,
    "cost":"6",
    "range":"Up to 60 feet away",
    "duration":"Instant",
    "source":"Rifts Ultimate Edition",
    "page":201,
    "type":"",
    "usage":["Defensive.png"],
	"save":"Standard",
	"description":"The utterance of this magic will turn/repel 1D6 animated dead per level of experience. This means that those creatures affected will turn and immediately leave the area without harming the spell caster or anyone near him. The dead turned will not come back for 24 hours. This magic only affects "animated" dead, and skeletons or corpses that are magically animated like marionettes, but will not affect vampires, zombies, or any corpse or skeleton possessed by a living entity."
  },
  {
    "invocationName":"Armor of Ithan",
    "level":3,
    "cost":"10",
    "range":"Self or other",
    "duration":"4 melees PLE",
    "source":"Rifts Ultimate Edition",
    "page":202,
    "type":"",
    "usage":["Defensive.png"],
	"save":"None",
	"description":"This powerful spell creates an invisible, weightless, noiseless, full suit of mystic armor instantly upon the spell caster. Named after the magic armor of the dwarf king Ithan, this mystic armor has an M.D.C. of 10 per level of experience. Magic, fire, lightning, and cold do one-half damage. The armor can be instantly created on anyone, so long as the spell caster invokes the spell while touching the intended recipient."
  },
  {
    "invocationName":"Breath Without Air",
    "level":3,
    "cost":"5",
    "range":"Self, or others by touch",
    "duration":"12 melees PLE",
    "source":"Rifts Ultimate Edition",
    "page":202,
    "type":"",
    "usage":["Utility.png"],
	"save":"None",
	"description":"This invocation enables the person to function normally without air, whether it be underwater or in a vaccuum, or in an area with little or no oxygen. Unfortunately, the magic does not protect the person from magic toxins or other sypes of magic, but does protect against natural and man-made gases."
  },
  {
    "invocationName":"Energy Bolt",
    "level":3,
    "cost":"5",
    "range":"150 feet",
    "duration":"Instant",
    "source":"Rifts Ultimate Edition",
    "page":202,
    "type":"",
    "usage":["Offensive.png"],
	"save":"Dodge of an 18 or higher",
	"description":"This incantation creates an energy bolt that the mage can mentally direct simply by looking at his intended target. The bolt may appear to fire from a hand or finger, or from the eyes, but needs no physical gesture. S.D.C. damage is normally 4D6, but is increased to 6D6 under the influence of a ley line, and 8D6 at a ley line nexus; PPE cost is the same despite the increased damage. One energy bolt can be fired at one target per each spell invocation."
  },
  {
    "invocationName":"Fingers of the Wind",
    "level":3,
    "cost":"5",
    "range":"90 feet",
    "duration":"3 melees PLE",
    "source":"Rifts Ultimate Edition",
    "page":202,
    "type":"",
    "usage":["Utility.png"],
	"save":"",
	"description":"The magician can conjure a wind and manipulare it to touch, tap, bump, or press against a person or object. It can also put out candles, slam doors shut, or move or knock over small items weighing less than 10 lbs."
  },
  {
    "invocationName":"Float in Air",
    "level":3,
    "cost":"5",
    "range":"Self, or others within 30 feet",
    "duration":"10 melees PLE",
    "source":"Rifts Ultimate Edition",
    "page":202,
    "type":"",
    "usage":["Utility.png"],
	"save":"None",
	"description":"This spell creates air currents which hold a person or object aloft, hovering about 1 foot above the ground. It can be used to slow someone's descent from a fall or used to float on top of water. Movement is awkward and slow while in the air. The floating person suffers the following penalties: all attacks, strikes, parries, and dodges are at -1; normal speed/movement is reduced to half."
  },
  {
    "invocationName":"Fuel Flame",
    "level":3,
    "cost":"5",
    "range":"100 feet",
    "duration":"Instant",
    "source":"Rifts Ultimate Edition",
    "page":202,
    "type":"",
    "usage":["Offensive.png", "Utility.png"],
	"save":"None",
	"description":"The magic feeds any existing fire, doubling it in size. It can affect a 10 square foot area up to 100 ft. away."
  },
  {
    "invocationName":"Ingite Fire",
    "level":3,
    "cost":"6",
    "range":"40 feet",
    "duration":"Instant",
    "source":"Rifts Ultimate Edition",
    "page":202,
    "type":"",
    "usage":["Utility.png"],
	"save":"None",
	"description":"A magic that causes spontaneous combustion. The magic will ignite any material that can burn. This means the mystic could set a chair on fire, a jacket, hair, etc. Note: Volatile substances that are contained in something, like gasoline in the gas tank of a car, can NOT be ignited. The target to be set on fire must be clearly visible. Maximum area of effect is 3 square feet. If somebody's clothes or hair is set on fire, they have two melees (30 seconds) to get it off our put out the fire before damage is inflicted; no other combat or action is possible. Damage from the small fire is 2D6 SDC per melee (beginning after the first two melees)."
  },
  {
    "invocationName":"Impervious to Fire",
    "level":3,
    "cost":"5",
    "range":"Self, or other up to 60 feet away",
    "duration":"5 minutes",
    "source":"Rifts Ultimate Edition",
    "page":202,
    "type":"",
    "usage":["Buff.png", "Defensive.png"],
	"save":"None",
	"description":"A magic invocation that makes the individual temporarily impervious to fire. Normal and magic fires do no damage to the person or to anything he is wearing/on his person."
  },
  {
    "invocationName":"Impervious to Poison",
    "level":3,
    "cost":"5",
    "range":"Self only",
    "duration":"5 minutes PLE",
    "source":"Rifts Ultimate Edition",
    "page":203,
    "type":"",
    "usage":["Buff.png", "Defensive.png"],
	"save":"None",
	"description":"This enchantment makes the person temporarily impervious to poisons, deadly toxins, and poison gases."
  },
  {
    "invocationName":"Invisibility (Simple)",
    "level":3,
    "cost":"6",
    "range":"Self only",
    "duration":"3 minutes PLE",
    "source":"Rifts Ultimate Edition",
    "page":203,
    "type":"",
    "usage":["Utility.png", "Buff.png"],
	"save":"None",
	"description":" The spell caster and anything he is wearing or carrying at the time of theinvocation are turned completely invisible. Any object picked up after the character has become invisible remains visible. Likewise, any object on his person that is dropped becomes visible. Neither normal nor nightvision can detect invisibility; only beings who can naturally, psionically, or magically see the invisible can see the spell caster. Infrared and heat detectors can also pinpoint an invisible person.

Although the invisible person is imperceptible to the eye, he still retains physical mass. This means he cannot go through walls nor can weapons pass harmlessly through him. The character still makes noise, leaves footprints, and physical and magical contacts/attacks still affect him as usual.

While invisible, the mage can talk, weave spells, walk, climb, run, open doors, carry objects, and perform other acts of physical exertion, including combat, and remain invisible. The invisibility is terminated when the magic's duration has elapsed or the mage cancels the spell. Note: if cut, only the blood is visible."
  },
  {
    "invocationName":"Life Source",
    "level":3,
    "cost":"Special",
    "range":"Self",
    "duration":"Instant",
    "source":"Rifts Ultimate Edition",
    "page":203,
    "type":"",
    "usage":["Utility.png"],
	"save":"",
	"description":""
  },
  {
    "invocationName":"Light Healing",
    "level":3,
    "cost":"6",
    "range":"Touch",
    "duration":"Instant",
    "source":"Rifts Ultimate Edition",
    "page":203,
    "type":"",
    "usage":["Healing.png"],
	"save":"",
	"description":""
  },
  {
    "invocationName":"Magic Shield",
    "level":3,
    "cost":"6",
    "range":"Self",
    "duration":"2 minutes",
    "source":"Rifts Ultimate Edition",
    "page":203,
    "type":"",
    "usage":["Buff.png", "Defensive.png"],
	"save":"",
	"description":""
  },
  {
    "invocationName":"Mystic Fulcrum",
    "level":3,
    "cost":"5",
    "range":"Touch",
    "duration":"5 minutes",
    "source":"Rifts Ultimate Edition",
    "page":203,
    "type":"",
    "usage":["Utility.png"],
	"save":"",
	"description":""
  },
  {
    "invocationName":"Negate Poison Toxin",
    "level":3,
    "cost":"5",
    "range":"Self or by Touch",
    "duration":"Instant",
    "source":"Rifts Ultimate Edition",
    "page":203,
    "type":"",
    "usage":["Healing.png"],
	"save":"None",
	"description":"This arcansit can magically turn a poisonous substance inert, rendering it harmless. The magic can also be used to instantly negate poison in the bloodstream preventing further damage by the foul substance. However, any damage caused by the poison before the magic is used can not be reversed using this spell."
  },
  {
    "invocationName":"Paralysis (Lesser)",
    "level":3,
    "cost":"5",
    "range":"60 feet",
    "duration":"4 melees PLE",
    "source":"Rifts Ultimate Edition",
    "page":203,
    "type":"",
    "usage":["Debuff.png"],
	"save":"",
	"description":"This magic attack temporarily paralyzes a part of its victim's body, immobilizing that particular limb. A paralyzed hand means that the person cannot pick up or hold objects or write. A paralyzed arm means that the limb dangles uselessly at teh person's side. A paralyzed leg will make standing difficult amd movement almost impossible; reduce speed by 90%, and -1 to parry and dodge. Note: The incantation will paralyze only one limb per each invoking of the magic. Internal organs cannot be affected, so the mage cannot paralyze a heart or lung, etc. Paralysis can not affect people inside a vehicle, robot, power armor, or MDC body armor."
  },
  {
    "invocationName":"Resist Fire",
    "level":3,
    "cost":"6",
    "range":"Self or tow others up to 60 feet away",
    "duration":"20 melees PLE",
    "source":"Rifts Ultimate Edition",
    "page":204,
    "type":"",
    "usage":["Buff.png", "Debuff.png"],
	"save":"None",
	"description":"With this spell, the spell caster can make himself, or one or two others, fire resistant. This meams that heat has no ill effect, and fire, normal or mystic, does half damage."
  },
  {
    "invocationName":"Blind",
    "level":4,
    "cost":"6",
    "range":"10 feet",
    "duration":"1 minutes",
    "source":"Rifts Ultimate Edition",
    "page":204,
    "type":"",
    "usage":["Debuff.png"],
	"save":"",
	"description":""
  },
  {
    "invocationName":"Carpet of Adhesion",
    "level":4,
    "cost":"10",
    "range":"30 feet PLE",
    "duration":"10 melees PLE",
    "source":"Rifts Ultimate Edition",
    "page":204,
    "type":"",
    "usage":["Debuff.png", "Utility.png"],
	"save":"If a successful saving throw vs. magic is made, that player rolls 2D6 to see how many melee rounds it will take him to pull free. Those failing to make the saving throw are stuck for the entire duration of the spell. Effective even against borgs, power armor, and robots.",
	"description":"The spell caster creates a sticky carpet, up to 10 ft. wide by 20 ft. long, that will adhere firmly to anyone who touches it. The victim will stay stuck until the carpet spell time elapses, or until the spell caster cancels the spell. The carpet can be cast on a floor, table, wall, ceiling, etc., or actually cast upon a person. The spell caster can cast this "super-flypaper" up to 90 feet away, and can alter the size and shape, without exceeding the stated limit of 200 square feet."
  },
  {
    "invocationName":"Charismatic Aura",
    "level":4,
    "cost":"10",
    "range":"60 feet",
    "duration":"6 melees PLE",
    "source":"Rifts Ultimate Edition",
    "page":204,
    "type":"",
    "usage":["Buff.png", "Utility.png"],
	"save":"Standard",
	"description":" A particularly handsome tool of deception, this magic can be cast upon the spell caster or another person. The spell instantly enhances that person's physical beauty by +8, increasing his charisma and charming all who behold him. Although the focal point of the spell is the person on whom it is cast, it effects everybody in a 60 foot radius from that person. Thus everybody in that radius must save vs. magic. Those who successfully save wll not be affected at all; those who fail to save are affected, and will respond accordingly.
The person with the charismatic aura can invoke one of three responses: friendship/trust, power/fear, or successful deception.

    Friendship/Trust: The first few words spoken will set up the response. Thus, a statement of friendship, peace, or trust will inspire those sentiments in everyone effected.
    Power/Fear: A statement of power, anger, strength, or vile intent will strike awe and fear into everyone effected. Example: "Lay down your weapons and let us pass, or suffer my wrath!" Horror Factor: 13.
    Successful Deception: This enables the person with the charismatic aura to convincingly lie like a master con-man. There is an 80% cahnce that those affected will believe anything he tells them. This response is triggered by a phrase like "Trust me..." or "I would never lie to you." "
  },
  {
    "invocationName":"Cure Minor Disorders",
    "level":4,
    "cost":"10",
    "range":"Touch or 10 feet",
    "duration":"Instant",
    "source":"Rifts Ultimate Edition",
    "page":204,
    "type":"",
    "usage":["Healing.png"],
	"save":"Standard",
	"description":"A unique bit of curative magic that will instantly relieve minor physical disorders and illnesses, such as ehadaches, indigestion, gas, heartburn, nausea, hiccups, muscle stiffness, low fever (under 101 degrees), and similar. It will also negate simple curses that inflict minor disorders."
  },
  {
    "invocationName":"Electric Arc",
    "level":4,
    "cost":"8",
    "range":"30 feet",
    "duration":"0.25 minutes",
    "source":"Rifts Ultimate Edition",
    "page":204,
    "type":"",
    "usage":["Offensive.png"],
	"save":"",
	"description":""
  },
  {
    "invocationName":"Energy Field",
    "level":4,
    "cost":"10",
    "range":"Self or others up to 60 feet",
    "duration":"1 minute PLE",
    "source":"Rifts Ultimate Edition",
    "page":205,
    "type":"",
    "usage":["Defensive.png", "Utility.png"],
	"save":"None",
	"description":"This creates a protective field of energy around the mystic, others, or an object. The maximum area of protection is about 8 ft., which means that it can protect a small roomful of people (about 6 to 8 individuals). The energy field appears as a semi-transparent wall or bubble that shimmers with a blue-white light. The field normally provides a total protection of 60 MDC, but is doubled at ley lines, and tripled at ley line nexuses."
  },
  {
    "invocationName":"Fire Bolt",
    "level":4,
    "cost":"7",
    "range":"100 feet plus 5 feet PLE",
    "duration":"Instant",
    "source":"Rifts Ultimate Edition",
    "page":205,
    "type":"",
    "usage":["Offensive.png"],
	"save":"Dodge",
	"description":"Like the energy bolt, the mage can direct a bolt of fire. Bonus to strike os +4. The mage can adjust the damage between the MDC and SDC settings, both cost the same amount of PPE. 
	Damage: 4D6 MDC, or 1D6 x 10 SDC."
  },
  {
    "invocationName":"Fist of Fury",
    "level":4,
    "cost":"10",
    "range":"Touch",
    "duration":"0.25 minutes",
    "source":"Rifts Ultimate Edition",
    "page":205,
    "type":"",
    "usage":["Offensive.png"],
	"save":"",
	"description":""
  },
  {
    "invocationName":"Fool's Gold",
    "level":4,
    "cost":"10",
    "range":"5 feet",
    "duration":"4 minutes plus 20 melees PLE",
    "source":"Rifts Ultimate Edition",
    "page":205,
    "type":"",
    "usage":["Healing.png"],
	"save":"Standard",
	"description":"This elemental magic enables the magician to cause any object to appear to be made of gold. After the magician leaves, the object will still retain its gold appearance until the spell elapses. The effect is temporary, and upon close examination by those who can recognize precious metals it is seen that it is not gold. Those who successfully make their saving throw will recognize the object to be fool's gold."
  },
  {
    "invocationName":"Ley Line Transmission",
    "level":4,
    "cost":"30",
    "range":"Limited by length of Ley Line",
    "duration":"Instant",
    "source":"Rifts Ultimate Edition",
    "page":205,
    "type":"",
    "usage":["Healing.png"],
	"save":"A Psionic mind block will block and destroy the message",
	"description":"The spell caster can send a verbal and/or audio message directly along a ley line to another person so long as that person is located somewhere on the line. The best messages are brief ones under a hundred words to avoid overwhelming the recipient. Unfortunately, the message is a one-way transmission unless the other person is a Ley Line Walker or another mage with the Transmission spell. Range is limited only by the length of the ley line and teh people's positions on the line. The time lapse between sending and receiving a ley line transmission is only a matter of seconds. The message can be sent to several people (one per level of experience) at different locations, as long as they are all on the ley line.
The only danger is that a telepath (psionic or magic) may be able to listen in on the message. There is a 20% chance that any psionic or magic character with the telepathy power will sense a ley line transmission coming through, and there is a 31% chance that they too can receive the message. There is no way for the sender to know if others have eavesdropped on his message. Nor is there any way to scramble the message."
  },
  {
    "invocationName":"Magic Net",
    "level":4,
    "cost":"7",
    "range":"60 feet",
    "duration":"2 melees PLE",
    "source":"Rifts Ultimate Edition",
    "page":205,
    "type":"",
    "usage":["Debuff.png"],
	"save":"Dodge of 16 or higher",
	"description":"This spell creates a net composed of magic fibers which will snare 1D6 human-sized victims within a 10 ft. area. Normal weapons can not cut through the net, only mega-damage weapons, magic weapons, and magic can affect it. Even then, it requires two full melee rounds to cut or blast it out (a Dispel Magic Barriers spell will dispel it instantly). Anyone caught in this net is helpless and unable to attack or defend. The spell caster can cancel the net at any time."
  },
  {
    "invocationName":"Multiple Image",
    "level":4,
    "cost":"7",
    "range":"Self",
    "duration":"4 melees PLE",
    "source":"Rifts Ultimate Edition",
    "page":206,
    "type":"",
    "usage":["Buff.png"],
	"save":"Special penalty of -4 to save",
	"description":"An illusion that creates three exact duplicate images of the mage which mimic his every movement exactly. Only piercing the image with iron will dispel that particular image. This is a great way to confuse, scare, and distract an opponent or opponents. Provides the mage with the bonus of +2 on initiative, +2 to dodge, and +1 to strike. Viewers may be able to see through the illusion and identify the true person, but such rolls vs. magic are at a -6."
  },
  {
    "invocationName":"Repel Animals",
    "level":4,
    "cost":"7",
    "range":"30 feet",
    "duration":"Immediate",
    "source":"Rifts Ultimate Edition",
    "page":206,
    "type":"",
    "usage":["Utility.png"],
	"save":"Standard",
	"description":"The character can invoke an enchantment that will make even a hostile predatory animal stop, turn, and leave the area without harming the mage or anyone near him. The animal will not return for hours. The enchantment can affect six animals simultaneously."
  },
  {
    "invocationName":"Shadow Meld",
    "level":4,
    "cost":"10",
    "range":"Self",
    "duration":"2 minutes PLE",
    "source":"Rifts Ultimate Edition",
    "page":206,
    "type":"",
    "usage":["Utility.png"],
	"save":"None",
	"description":"This unique magic enables the mage to step into shadows, becoming totally invisible, even to those who can "see the invisible." The shadow must be at least five feet tall to become an effective hiding place. The shadow serves as a superior means of hiding or moving unseen. The mage can move, walk, or run through the length of shadow or from shadow to shadow. While in shadow darkness, the mage prowls at 60% proficiency (or at +15% to normal skill, whichever is higher). Intense light will dispel the shadow, leaving the mage revealed. Of course, sanctuary can be found by fleeing into another shadow. Feeble light, less than 10 torches or 300 watts, will only create more shadows. When hidden in shadow, the character is still susceptible to magic, psychic, and physical attacks, although attackers are -5 to strike him (because they cannot see him). Area affect attacks do not suffer any penalty. Infrared/thermal optics are the most effective means to see someone in a shadow."
  },
  {
    "invocationName":"Swim as a Fish",
    "level":4,
    "cost":"6",
    "range":"Self or others up to 10 feet away",
    "duration":"5 minutes PLE",
    "source":"Rifts Ultimate Edition",
    "page":206,
    "type":"",
    "usage":["Buff.png", "Utility.png"],
	"save":"None",
	"description":"An incantation that provides the character with exceptional swimming abilities. Equal to Advanced Swimming and SCUBA skills combined. Base skill is 96%, can swim a distance equal to 100 x PS in yards/meters without tiring, additional +1 to parry and dodge while in water, and can hold breath for two minutes/8 melees at a time."
  },
  {
    "invocationName":"Trance",
    "level":4,
    "cost":"10",
    "range":"Touch or within 12 feet",
    "duration":"5 minutes PLE",
    "source":"Rifts Ultimate Edition",
    "page":206,
    "type":"",
    "usage":["Debuff.png"],
	"save":"Standard",
	"description":"The enchantment places another person into a zombie-like state in which the entranced person is in a hypnotic daze, unaware of his environment or happenings around him. He can not formulate thoughts, use skills, or act on his own. While entranced, the individual is only aware of the enchanter's voice and will follow extremely simple commands. The entranced victim can NOT engage in any type of combat to any degree, nor any actions that require skill or thought, and offers no resistance. The magic is meant to incapacitate more than it is to enslave.
While entranced, the person can not be made to reveal secrets, betray a friend, harm himself, or act against his alignment. All physical attributes function as if they are half what they really are; a speed of 10 wouldbe 5 while entranced. The victim of the trance will remember nothing of the events that occurred while entranced. Can not affect people inside power and MDC body armor, robots, or vehicles."
  },
  {
    "invocationName":"Armor Bizarre",
    "level":5,
    "cost":"15",
    "range":"30 feet",
    "duration":"1 minutes",
    "source":"Rifts Ultimate Edition",
    "page":206,
    "type":"",
    "usage":["Buff.png"],
	"save":"",
	"description":""
  },
  {
    "invocationName":"Calling",
    "level":5,
    "cost":"8",
    "range":"2 miles PLE",
    "duration":"5 minutes PLE",
    "source":"Rifts Ultimate Edition",
    "page":207,
    "type":"",
    "usage":["Utility.png"],
	"save":"Standard",
	"description":"The calling is like a limited form of telepathic communication in which the mage can mentally call a specific individual. To use "the call", the mystic must know the person's whole name (first and last), must have personally met the individual (even if only briefly), and must be within range. The call sends out a telepathic message to that particular person, calling him or her by full name, and leaves an impression of where the mage can be found. A typical call message will be something like "Steve Mitchell, come here," or "Trent Harris, get your ass over here NOW!" Only the individual to whom the message is made can hear it, and no one else. If a successful saving throw is made, the call and impression of location is only heard once. If the throw is not successful, the call will repeat itself over and over every 5 seconds (three times per melee) until either the spell elapses or the person goes to the mage. Nothing except a mind block can block out the call, and aspirin, psionic healing, or curative magic may be needed for those who fail the saving throw (rolling a d20 under the called person's ME attribute means no aspirin needed)."
  },
  {
    "invocationName":"Charm",
    "level":5,
    "cost":"12",
    "range":"15 feet",
    "duration":"1 minutes",
    "source":"Rifts Ultimate Edition",
    "page":207,
    "type":"",
    "usage":["Utility.png"],
	"save":"",
	"description":""
  },
  {
    "invocationName":"Circle of Flame",
    "level":5,
    "cost":"10",
    "range":"10 feet around self",
    "duration":"2 minutes PLE",
    "source":"Rifts Ultimate Edition",
    "page":207,
    "type":"",
    "usage":["Defensive.png"],
	"save":"None",
	"description":"The mystic can create a circle of flame round himself. No combustible material is required. The flame is five feet tall and inflicts 6D6 SDC damage to anyone who tries to pass through the fire."
  },
  {
    "invocationName":"Distant Voice",
    "level":5,
    "cost":"10",
    "range":"2000 feet",
    "duration":"5 minutes",
    "source":"Rifts Ultimate Edition",
    "page":207,
    "type":"",
    "usage":["Utility.png"],
	"save":"",
	"description":""
  },
  {
    "invocationName":"Domination",
    "level":5,
    "cost":"10",
    "range":"Touch or within 4 feet",
    "duration":"15 minutes PLE",
    "source":"Rifts Ultimate Edition",
    "page":207,
    "type":"",
    "usage":["Debuff.png", "Utility.png"],
	"save":"Standard",
	"description":"Domination is another trance-like enchantment that enables the mystic to impose his will over the victim's, forcing the person to do his bidding. The victim of domination will appear to be acting oddly, dazed, confised, slow and unfriendly. The enchanted person has one goal: the fulfill the command of the mage. Under the enchantment of domination, the character's alignment does NOT apply. He will steal, lie, assist in crimes, kidnape, betray friends, reveal secrets, and so on. The only things the bewitched character will not do are commit suicide, inflict self-harm, or kill a friend or loved one. A good aligned person (principled, scrupulous, and possibly even unprincipled) cannot be made to kill anybody, it is too deeply rooted against their alignment.
The enchanted person is not himself, and suffers the following penalties. Attacks per melee are half, speed is half, all skills are half their usual proficiency, speech is slow, and the person seems distracted or a little dazed.
A successful saving throw vs. magic means the magic has no effect; the person is 100% his normal self. The effects of domination magic can not be faked, unless one successfully passes a Performance skill roll. Can not affect a person inside MDC body or power armor, robots, or vehicles."
  },
  {
    "invocationName":"Energy Disruption",
    "level":5,
    "cost":"12",
    "range":"60 feet",
    "duration":"3 minutes PLE",
    "source":"Rifts Ultimate Edition",
    "page":207,
    "type":"",
    "usage":["Utility.png"],
	"save":"None",
	"description":"A particularly useful magic in a tech environment. The invocation will temporarily knock out, stop, or immobilize any electrical device it is aimed at. This includes normal automobiles, computers, radios, surveillance cameras, sensors, appliances, enitre fuse boxes, batteries, electric alarm systems, etc. The apparatus is not harmed in any way, it simply ceases to function. When the magic elapses, the item(s) will work perfectly, with no sign of malfunction or energy loss. At the GM's discretion, this may or may not affect MDC power armor, robots, or military vehicles."
  },
  {
    "invocationName":"Escape",
    "level":5,
    "cost":"8",
    "range":"Self, touch, or 5 feet",
    "duration":"Instant",
    "source":"Rifts Ultimate Edition",
    "page":208,
    "type":"",
    "usage":["Defensive.png", "Utility.png"],
	"save":"None",
	"description":"The escape invocation enables the mage to magically escape any bonds, or open any locking mechanism that bars his way. This includes being tied with rope, handcuffs, prison cells, doors, trunks, locks, straightjackets, etc. One restraint or lock can be undone per each invocation (one per melee is possible). Only gagging the mage will prevent the use of this magic."
  },
  {
    "invocationName":"Eyes of Thoth",
    "level":5,
    "cost":"8",
    "range":"Self, or others by touch",
    "duration":"10 minutes PLE",
    "source":"Rifts Ultimate Edition",
    "page":208,
    "type":"",
    "usage":["Utility.png"],
	"save":"None",
	"description":"Thoth was the god of knowledge and wisdom of the ancient Egyptians, and was said to know all languages. This invocation enables the character to read and understand ALL written languages, modern, ancient, and dead. However, the spoken languages are incomprehensible unless a tongues spell is also invoked or the person has an education in that language."
  },
  {
    "invocationName":"Featherlight",
    "level":5,
    "cost":"10",
    "range":"10 feet",
    "duration":"10 minutes",
    "source":"Rifts Ultimate Edition",
    "page":208,
    "type":"",
    "usage":["Utility.png"],
	"save":"",
	"description":""
  },
  {
    "invocationName":"Fly",
    "level":5,
    "cost":"15",
    "range":"Object by touch",
    "duration":"6 minutes PLE",
    "source":"Rifts Ultimate Edition",
    "page":208,
    "type":"",
    "usage":["Utility.png"],
	"save":"None",
	"description":"The arcanist can magically bestow the power of flight only to an inanimate object not made of metal or plastic. He or she can then use that object to fly. This spell is the basis of the myths about the witch and her broom, and of flying carpets. The object must be big enough to hold onto or, preferably, large enough to sit on. To avoid muscle strain, it is best that the object can be comfortably sat upon. The maximum length and width of the object must not exceed six feet. This magic will not work if the object has any metal or plastic on it, including nails. Maximum altitude is 1000 ft. Maximum speed is 35 mph; the object can be made to hover stationary."
  },
  {
    "invocationName":"Heal Wounds",
    "level":5,
    "cost":"10",
    "range":"Rouch or 30 foot distance",
    "duration":"Instant",
    "source":"Rifts Ultimate Edition",
    "page":208,
    "type":"",
    "usage":["Healing.png"],
	"save":"Standard, if the person resists the magic",
	"description":"This powerful invocation will instantly heal minor physical wounds, such as bruises, cuts, gashes, bullet wounds, burned flesh, and pulled muscles. It will not help against illness, internal damage to organs or nerves, broken bones, or poisons/drugs. Int he case of bullet wounds, the bullet should be removed first, or it could cause further damage. The spell restores 3D6 SDC and 1D6 hit points."
  },
  {
    "invocationName":"House of Glass",
    "level":5,
    "cost":"12",
    "range":"100 feet",
    "duration":"1 minutes",
    "source":"Rifts Ultimate Edition",
    "page":208,
    "type":"",
    "usage":["Defensive.png"],
	"save":"",
	"description":""
  },
  {
    "invocationName":"Lifeblast",
    "level":5,
    "cost":"15",
    "range":"30 feet",
    "duration":"Varies",
    "source":"Rifts Ultimate Edition",
    "page":209,
    "type":"",
    "usage":["Offensive.png", "Utility.png", "Healing.png"],
	"save":"",
	"description":""
  },
  {
    "invocationName":"Sleep",
    "level":5,
    "cost":"10",
    "range":"Touch or 1 foot",
    "duration":"Becomes inert within 15 minutes, effects last 10 minutes PLE",
    "source":"Rifts Ultimate Edition",
    "page":209,
    "type":"",
    "usage":["Utility.png"],
	"save":"",
	"description":"The invocation can turn any normal, drinkable fluid or food into a sleep inducing potion. Immediately, after two bites of enchanted foor or two gulps of fluid, the person will fall into an enchanted sleep. The victim cannot be awakened by any means except by the mage cancelling the magic or until the magic's duration time elapses. A successful save means the enchanted food or drink has no effect."
  },
  {
    "invocationName":"Superhuman Endurance",
    "level":5,
    "cost":"12",
    "range":"10 feet",
    "duration":"120 minutes",
    "source":"Rifts Ultimate Edition",
    "page":209,
    "type":"",
    "usage":["Buff.png", "Utility.png"],
	"save":"",
	"description":""
  },
  {
    "invocationName":"Superhuman Strength",
    "level":5,
    "cost":"10",
    "range":"Self or others by touch",
    "duration":"2 melees PLE",
    "source":"Rifts Ultimate Edition",
    "page":209,
    "type":"",
    "usage":["Buff.png", "Utility.png"],
	"save":"None",
	"description":"This invocation bestows the character a supernatural PS of 30 and a PE of 24, as well as adding 30 SDC for the duration of the magic. Bonuses last for the duration of the magic."
  },
  {
    "invocationName":"Superhuman Speed",
    "level":5,
    "cost":"10",
    "range":"Touch",
    "duration":"1 minutes",
    "source":"Rifts Ultimate Edition",
    "page":209,
    "type":"",
    "usage":["Buff.png", "Utility.png"],
	"save":"",
	"description":""
  },
  {
    "invocationName":"Call Lightning",
    "level":6,
    "cost":"15",
    "range":"300 feet",
    "duration":"Instant",
    "source":"Rifts Ultimate Edition",
    "page":209,
    "type":"",
    "usage":["Offensive.png"],
	"save":"None",
	"description":"This spell creates a lightning bolt which can be directed at any specific target up to 300 feet away. The lightning bolt shoots down from the sky, hitting the desired target. The target or area must be withing the spell caster's line of vision. Damage is 1D6 MDC per level of the caster."
  },
  {
    "invocationName":"Compulsion",
    "level":6,
    "cost":"20",
    "range":"60 feet within line of vision",
    "duration":"24 hours",
    "source":"Rifts Ultimate Edition",
    "page":210,
    "type":"",
    "usage":["Utility.png"],
	"save":"Standard",
	"description":"The spell caster can implant a sudden desire or need in another person's mind. The focus of the irresistable impulse should be something reasonable and attainable, although the motive may seem quite irrational. The enchanted person will be consumed with the object or action of the implanted compulsion, whether it be somethng very simple, like the craving for a candy bar, or the need to visit somebody or something more extravagant. The victim of this enchantment will be obsessed with obtaining whatever it is for the full duration time of the incantation or untl it is attained. A "remove curse" will also negate the compulsion."
  },
  {
    "invocationName":"Cure Illness",
    "level":6,
    "cost":"15",
    "range":"Touch or 30 feet",
    "duration":"Instant",
    "source":"Rifts Ultimate Edition",
    "page":210,
    "type":"",
    "usage":["Healilng.png"],
	"save":"Standard, if the person resists treatment",
	"description":"A potent magic that can cure ordinary disease and illness, such as fever, flu, and other common diseases. The magic can not cure cancer, lung disease, wounds, broken bones, or internal damage to organs. Nor can it cure magically induces sicknesses or disorders."
  },
  {
    "invocationName":"Fire Ball",
    "level":6,
    "cost":"10",
    "range":"90 feet",
    "duration":"Instant",
    "source":"Rifts Ultimate Edition",
    "page":210,
    "type":"",
    "usage":["Buff.png"],
	"save":"",
	"description":""
  },
  {
    "invocationName":"Impervious to Energy",
    "level":6,
    "cost":"20",
    "range":"Self or others by ritual",
    "duration":"2 minutes PLE",
    "source":"Rifts Ultimate Edition",
    "page":210,
    "type":"",
    "usage":["Buff.png", "Defensive.png"],
	"save":"None",
	"description":"The arcanist can make himself impervious to all forms of energy including fire, heat, electricity, lasers, and so on. Energy attacks do no damage whatsoever. Physical attacks, guns, knives, etc., do normal damage."
  },
  {
    "invocationName":"Magic Pigeon",
    "level":6,
    "cost":"20",
    "range":"Immediate Area",
    "duration":"2 months PLE",
    "source":"Rifts Ultimate Edition",
    "page":210,
    "type":"",
    "usage":["Healing.png"],
	"save":"None",
	"description":" Through the means of a special incantation the spell caster is able to create a mystic facsimile of a pigeon. The magic pigeon is able to deliver a spoken (30 words or less) or written message to anyone, anyplace in the same dimension as the caster. However, the caster must know the general location of the recipient of the message and a specific person (or two) to receive the message. Upon reaching its destination, the pigeon will seek out that person and immediately deliver the message. If the recipient is not at the prescribed destination it will wait until he returns or until the spell duration elapses and it fades away. The magic pigeon looks exactly like a real pigeon, but needs no food or rest; thus it can fly 720 miles every 24 hours at a speed of 30 mph. Normal weapons cannot harm or capture the pigeon, but magic spells of entrapment can capture it. Only a dispel magic spell can destroy it."
  },
  {
    "invocationName":"Mask of Deceit",
    "level":6,
    "cost":"15",
    "range":"Self",
    "duration":"10 minutes PLE",
    "source":"Rifts Ultimate Edition",
    "page":210,
    "type":"",
    "usage":["Healing.png"],
	"save":"Special",
	"description":"A useful tool for deception, it magically creates an illusionary mask over the person's own facial features. Age, gender, skin color, hair, hair length, and specific features are composed with thought. However, the magic is limited to facial features, and does not apply to any other part of the body. The mage can attempt to imitate a specific person's face, but has a per 20% + 5% per level of experience; if the character has the disguise skill, use that percentage instead.
Everyone encountering the person gets a save vs. magic, but at a -4 to do so. A successful save means the true features are seen, not the mask."
  },
  {
    "invocationName":"Reduce Self",
    "level":6,
    "cost":"20",
    "range":"Self",
    "duration":"2.5 minutes PLE",
    "source":"Rifts Ultimate Edition",
    "page":210,
    "type":"",
    "usage":["Healing.png"],
	"save":"None",
	"description":"This spell instantly shrinks the spell caster, his clothes, and possessions to six inches tall. At this size, mega-damage weapons inflict a mere ONE point of SDC damage, all others simply sting."
  },
  {
    "invocationName":"Sheltering Force",
    "level":6,
    "cost":"20",
    "range":"20 feet",
    "duration":"60 minutes",
    "source":"Rifts Ultimate Edition",
    "page":210,
    "type":"",
    "usage":["Defensive.png"],
	"save":"",
	"description":""
  },
  {
    "invocationName":"Teleport (Lesser)",
    "level":6,
    "cost":"15",
    "range":"Five miles PLE, touch",
    "duration":"Requires 30 seconds",
    "source":"Rifts Ultimate Edition",
    "page":211,
    "type":"",
    "usage":["Utility.png"],
	"save":"None",
	"description":"The power to transmit matter from one place to another. The lesser teleport incantation is limited to non-living substances. Up to 50 lbs. can be instantly transported from the location of where the spell caster is to any location, possibly miles away. The only requires are that the mage touches the object to be teleported, and that the mage knows the location of where it is being sent. Success ratio: 80% + 2% per experience level of the arcanist. An unsuccessful roll means that the object never arrived where it was supposed to, and could be anywhere within the mage's range."
  },
  {
    "invocationName":"Tongues",
    "level":6,
    "cost":"12",
    "range":"Self or others by touch",
    "duration":"3 minutes PLE",
    "source":"Rifts Ultimate Edition",
    "page":211,
    "type":"",
    "usage":["Utility.png"],
	"save":"None",
	"description":"The magic enables the character to perfectly understand and speak all spoken languages at a 98% proficiency. An understanding of written languages is not provided by this magic."
  },
  {
    "invocationName":"Words of Truth",
    "level":6,
    "cost":"15",
    "range":"5 feet",
    "duration":"1 minute PLE",
    "source":"Rifts Ultimate Edition",
    "page":211,
    "type":"",
    "usage":["Utility.png"],
	"save":"Standard",
	"description":"A person affected by this enchantment is compelled to answer all questions truthfully. The arcanist must be within five feet and can ask two brief questions per melee. It is wise to keep questions simple and clear to avoid confusion. The enchanted person makes a saving throw for each question asked. A successful save means he doesn't have to answer. Questions can be repeated."
  },
  {
    "invocationName":"Agony",
    "level":7,
    "cost":"20",
    "range":"5 feet PLE",
    "duration":"1 minute",
    "source":"Rifts Ultimate Edition",
    "page":211,
    "type":"",
    "usage":["Debuff.png"],
	"save":"Standard",
	"description":"A particularly cruel and painful invocation that incapacitates its victim with pain. Under the influence of the magic, the victim has no attacks per melee, can not move or even speak; only writhe in agony. Although there is no physical damage (no SDC or hit points are lost), the pain IS real. It will take a full minute after the magic elapses for the victim to regain his full composure. During that minute, his number of attacks per melee are reduced by half, speed is reduced by half, and he suffers a penalty of -1 to strike, parry, and dodge. Only one person can be affected per invocation."
  },
  {
    "invocationName":"Animate and Control Dead",
    "level":7,
    "cost":"20",
    "range":"400 feet/line of vision",
    "duration":"5 minutes PLE",
    "source":"Rifts Ultimate Edition",
    "page":211,
    "type":"",
    "usage":["Utility.png"],
	"save":"None",
	"description":" With this incantation, the arcanist can animate the remains of dead bodies -- human, animal, or monster -- and mentally control them like a puppetmaster would a marionette. The remains are not alive and do not have any intelligence whatsoever. It is the sorcerer who controls their actions.  Restrictions: 1.     The mage can animate and control only two corpses/skeletons, plus one per level of experience. 2.     The animated dead must remain in his line of vision. If it cannot be seen, it cannot be animated. 3.     The animated dead can be a corpse or skeleton. Attacks per melee: two each, Speed: 7, Damage: 1D6 from punch, bite, claw, or blunt weapon. Modern weapons, such as guns of any kind, can not be used by animated dead, although bladed weapons can. 4.     Only total destruction will stop an animated dead, or knocking out the controlling mage. SDC of a small corpse/skeleton, about 3 to 4 feet tall, is 50 SDC; medium, 5 to 6 feet tall, is 80 SDC; large, 7 to 12 ft. tall, is 140 SDC. Bullets do 1/3 damage, blunt and smashing attacks do full damage, fire does double normal damage. Animated dead can not be stunned, nor are they affected by a death blow or critical hit. They are SDC structures and inflict SDC damage, unless they wield and MDC weapon like a vibro-blade. "
  },
  {
    "invocationName":"Ballistic Fire",
    "level":7,
    "cost":"25",
    "range":"1000 feet",
    "duration":"Instant",
    "source":"Rifts Ultimate Edition",
    "page":211,
    "type":"",
    "usage":["Offensive.png"],
	"save":"",
	"description":""
  },
  {
    "invocationName":"Constrain Being",
    "level":7,
    "cost":"20",
    "range":"30 feet",
    "duration":"2 minutes PLE",
    "source":"Rifts Ultimate Edition",
    "page":212,
    "type":"",
    "usage":["Utility.png"],
	"save":"",
	"description":"This invocation is useful for controlling lesser supernatural creatures. The enchantment forces the being to obey the arcanist to obey the arcanist to a very limited degree. Mainly, the mage can hold the "thing" at bay with an order like: "Back, stay back." "Go... begone." "Stay there... don't move." "No." "Stop." "Back away." No commands more elaborate than that will be obeyed. The constrain being incantation works in the same way as a cross holds a vampire at bay. As long as the mage and his allies stay out of the creature's reach, the magic will hold it at bay. If it can reach out and hurt somebody, it will. If it is attacked, the enchantment is broken, and it is free to lash out at everybody. Note: possessing entities and the greater supernatural beings are not affected by this magic, nor are non-supernatural D-Bees or aliens."
  },
  {
    "invocationName":"Dispel Magic Barriers",
    "level":7,
    "cost":"20",
    "range":"Self or others up to 100 feet away",
    "duration":"Instant",
    "source":"Rifts Ultimate Edition",
    "page":212,
    "type":"",
    "usage":["Utility.png"],
	"save":"Standard",
	"description":"The dispel magic barriers spell negates/dispels all magic barrers of any kind, including the sorcerer's seal, carpet of adhesion, wall spells, wards, etc. Savings Throw: The magic spell being attacked automatically gets a savings throw as if it were a person. A successful save means the negate magic barriers spell has no effect; the barrier remains."
  },
  {
    "invocationName":"Fly as the Eagle",
    "level":7,
    "cost":"25",
    "range":"Self or others up to 100 feet away",
    "duration":"20 minutes PLE",
    "source":"Rifts Ultimate Edition",
    "page":212,
    "type":"",
    "usage":["Buff.png", "Utility.png"],
	"save":"None",
	"description":"The power of flight is bestowed upon the spell caster or person it is cast upon. It is especially effective out of doors, and in large, open areas. Maximum speed: 50 mph. Bonuses: +1 to parry, +2 to dodge, and +2 to damage on a diving attack. Bonuses apply only when in flight."
  },
  {
    "invocationName":"Globe of Silence",
    "level":7,
    "cost":"20",
    "range":"90 feet",
    "duration":"6 melees PLE",
    "source":"Rifts Ultimate Edition",
    "page":212,
    "type":"",
    "usage":["Debuff.png", "Utility.png"],
	"save":"None",
	"description":"This spell immediately creates an invisible, 10 ft. radius globe which stops all sound. Voices, screams, footsteps, Glitter Boy Boom Guns, everything within that 10 ft. radius is absorbed by the globe. This means that absolutely no no sound can leave the globe or penetrate it. So while it can prevent those within the globe from making noise, it also prevents sounds from outside to enter. Those within the globe cannot hear anything. A spell caster, reliant on spoken incantations, is completely powerless inside a globe of silence because his words cannot be heard. The spell affects those within its radius; stepping beyond the radius frees that person from its effect. The globe itself can be fixed in a stationary area, or mentally moved and manipulated by the spell caster. However, the spell caster cannot cast another spell while manipulating the globe, and once fixed to a spot it, that is where it remains until the spell duration elapses, or it is cancelled."
  },
  {
    "invocationName":"Heal Self",
    "level":7,
    "cost":"20",
    "range":"Self",
    "duration":"Instant",
    "source":"Rifts Ultimate Edition",
    "page":212,
    "type":"",
    "usage":["Healing.png"],
	"save":"",
	"description":""
  },
  {
    "invocationName":"Invisibility (Superior)",
    "level":7,
    "cost":"20",
    "range":"Self or others by touch",
    "duration":"3 minutes PLE",
    "source":"Rifts Ultimate Edition",
    "page":212,
    "type":"",
    "usage":["Utility.png"],
	"save":"None",
	"description":"A powerful incantation that makes the spell caster invisible to all means of detection. Infrared, ultraviolet, heat, motion detectors, and even an animal's sense of smell cannot locate the invisible person. No footprints are made, and little sound (Prowl 84%). The magic is broken only if the character makes a hostile move, or engages in combat. At that instant, he becomes completely visible."
  },
  {
    "invocationName":"Life Drain",
    "level":7,
    "cost":"25",
    "range":"30 feet",
    "duration":"30 seconds PLE",
    "source":"Rifts Ultimate Edition",
    "page":213,
    "type":"",
    "usage":["Debuff.png"],
	"save":"Standard",
	"description":"The life drain is a debilitating magic that weakens an opponent. The victim will turn pale and experience weakness. Reduce SDC by half, hit points by half, speed by half, attacks per melee by one, and skills are -10%. Low-level arcanists (1-3) can only affect one individual per each spell cast, but at fourth level the mage can also cast the magic on a 15 ft. area, affecting everyone who enters and remains int he area of enchantment. Once the magic's duration time has lapsed, teh victim's skills and attacks per melee return to normal, SDC returns at a rate of 8 per hour, and hit points return at a rate of 4 per hour. Reduced speed and a feeling of weakness remains for 6 hours. A successful saving throw means the magic has no effect on the person. Characters inside MDC body and power armor, robots, and vehicles are affected; Borgs are not."
  },
  {
    "invocationName":"Lightblade",
    "level":7,
    "cost":"20",
    "range":"Self",
    "duration":"1 minutes",
    "source":"Rifts Ultimate Edition",
    "page":213,
    "type":"",
    "usage":["Offensive.png"],
	"save":"",
	"description":""
  },
  {
    "invocationName":"Metamorphosis (Animal)",
    "level":7,
    "cost":"25",
    "range":"Self or others by ritual",
    "duration":"20 minutes PLE",
    "source":"Rifts Ultimate Edition",
    "page":213,
    "type":"",
    "usage":["Buff.png"],
	"save":"None",
	"description":"Theinvocation can completely transform a character into a particular animal, from an alley cat or cocker spaniel to a lian, wolf, alligator, or bird. As the animal, the character gets all the inherent abilities and defenses which that animal form may offer, but retians his own IQ, ability to speak, memory, SDC, and hit points. The mage can return to human form (naked) at will."
  },
  {
    "invocationName":"Purification (Food/Water)",
    "level":7,
    "cost":"20",
    "range":"Touch or 3 feet",
    "duration":"Instant",
    "source":"Rifts Ultimate Edition",
    "page":213,
    "type":"",
    "usage":["Utility.png"],
	"save":"None",
	"description":"The mystic can pruify food or water, cleansing it of disease, bacteria, and poison/toxins. Up to 50 lbs. of food or 10 gallons of water/fluid can be purified each time the spell is cast."
  },
  {
    "invocationName":"Wind Rush",
    "level":7,
    "cost":"20",
    "range":"120 feet",
    "duration":"1 melee",
    "source":"Rifts Ultimate Edition",
    "page":214,
    "type":"",
    "usage":["Debuff.png", "Utility.png"],
	"save":"18 or better to maintain balance",
	"description":"This spell creates a short, powerful wind gusting at 60 mph, which is capable of knocking people down, knocking riders off mounts, blowing small objects 20 to 120 feet away, or creating dust storms. The wind can be directed by the spell caster at a specific target, or a general sweep (maximum wind width: 20 ft.) can be made. Anyone caught in the wind is helpless and unable to attack or move against the wind. It takes an additional melee to recover, and 1d8 melees to gather up all items blown away."
  },
  {
    "invocationName":"Commune with Spirits",
    "level":8,
    "cost":"25",
    "range":"200 feet",
    "duration":"5 minutes",
    "source":"Rifts Ultimate Edition",
    "page":214,
    "type":"",
    "usage":["Utility.png"],
	"save":"",
	"description":""
  },
  {
    "invocationName":"Exorcism",
    "level":8,
    "cost":"30",
    "range":"30 feet",
    "duration":"3 minutes",
    "source":"Rifts Ultimate Edition",
    "page":214,
    "type":"",
    "usage":["Buff.png, Utility.png"],
	"save":"",
	"description":""
  },
  {
    "invocationName":"Expel Demons",
    "level":8,
    "cost":"35",
    "range":"10 feet",
    "duration":"Instant",
    "source":"Rifts Ultimate Edition",
    "page":214,
    "type":"",
    "usage":["Utility.png"],
	"save":"",
	"description":""
  },
  {
    "invocationName":"Eyes of the Wolf",
    "level":8,
    "cost":"25",
    "range":"Touch",
    "duration":"5 minutes",
    "source":"Rifts Ultimate Edition",
    "page":214,
    "type":"",
    "usage":["Buff.png", "Utility.png"],
	"save":"",
	"description":""
  },
  {
    "invocationName":"Forcebonds",
    "level":8,
    "cost":"25",
    "range":"Touch",
    "duration":"30 minutes",
    "source":"Rifts Ultimate Edition",
    "page":214,
    "type":"",
    "usage":["Debuff.png", "Utility.png"],
	"save":"",
	"description":""
  },
  {
    "invocationName":"Greater Healing",
    "level":8,
    "cost":"30",
    "range":"Touch",
    "duration":"Instant",
    "source":"Rifts Ultimate Edition",
    "page":215,
    "type":"",
    "usage":["Healing.png"],
	"save":"",
	"description":""
  },
  {
    "invocationName":"Ley Line Tendril Bolts",
    "level":8,
    "cost":"26",
    "range":"10 feet",
    "duration":"0.25 minutes",
    "source":"Rifts Ultimate Edition",
    "page":215,
    "type":"",
    "usage":["Offensive.png"],
	"save":"",
	"description":""
  },
  {
    "invocationName":"Lightning Arc",
    "level":8,
    "cost":"30",
    "range":"100 feet",
    "duration":"0.25 minutes",
    "source":"Rifts Ultimate Edition",
    "page":215,
    "type":"",
    "usage":["Offensive.png"],
	"save":"",
	"description":""
  },
  {
    "invocationName":"Locate",
    "level":8,
    "cost":"30",
    "range":"15 Miles",
    "duration":"Instant",
    "source":"Rifts Ultimate Edition",
    "page":215,
    "type":"",
    "usage":["Utility.png"],
	"save":"",
	"description":""
  },
  {
    "invocationName":"Luck Curse",
    "level":8,
    "cost":"40",
    "range":"Touch",
    "duration":"1440 minutes",
    "source":"Rifts Ultimate Edition",
    "page":215,
    "type":"",
    "usage":["Debuff.png"],
	"save":"",
	"description":""
  },
  {
    "invocationName":"Magical-Adrenal Rush",
    "level":8,
    "cost":"45",
    "range":"100 feet",
    "duration":"0.25 minutes",
    "source":"Rifts Ultimate Edition",
    "page":215,
    "type":"",
    "usage":["Buff.png"],
	"save":"",
	"description":""
  },
  {
    "invocationName":"Metamorphosis (Human)",
    "level":8,
    "cost":"40",
    "range":"Self",
    "duration":"20 minutes",
    "source":"Rifts Ultimate Edition",
    "page":216,
    "type":"",
    "usage":["Utility.png"],
	"save":"",
	"description":""
  },
  {
    "invocationName":"Negate Magic",
    "level":8,
    "cost":"30",
    "range":"60 feet",
    "duration":"Instant",
    "source":"Rifts Ultimate Edition",
    "page":216,
    "type":"",
    "usage":["Buff.png", "Offensive.png"],
	"save":"",
	"description":""
  },
  {
    "invocationName":"Power Weapon",
    "level":8,
    "cost":"35",
    "range":"Touch",
    "duration":"0.5 minutes",
    "source":"Rifts Ultimate Edition",
    "page":216,
    "type":"",
    "usage":["Buff", "Offensive.png"],
	"save":"",
	"description":""
  },
  {
    "invocationName":"Shockwave",
    "level":8,
    "cost":"45",
    "range":"10 feet",
    "duration":"Instant",
    "source":"Rifts Ultimate Edition",
    "page":216,
    "type":"",
    "usage":["Offensive.png"],
	"save":"",
	"description":""
  },
  {
    "invocationName":"Sickness",
    "level":8,
    "cost":"50",
    "range":"20 feet",
    "duration":"72 minutes",
    "source":"Rifts Ultimate Edition",
    "page":217,
    "type":"",
    "usage":["Defensive.png"],
	"save":"",
	"description":""
  },
  {
    "invocationName":"Spoil (Water/Food)",
    "level":8,
    "cost":"30",
    "range":"3 feet",
    "duration":"Instant",
    "source":"Rifts Ultimate Edition",
    "page":217,
    "type":"",
    "usage":["Utility.png"],
	"save":"",
	"description":""
  },
  {
    "invocationName":"Wisps of Confusion",
    "level":8,
    "cost":"40",
    "range":"90 feet",
    "duration":"1.25 minutes",
    "source":"Rifts Ultimate Edition",
    "page":217,
    "type":"",
    "usage":["Debuff.png"],
	"save":"",
	"description":""
  },
  {
    "invocationName":"Desiccate the Supernatural",
    "level":9,
    "cost":"50",
    "range":"50 feet",
    "duration":"Instant",
    "source":"Rifts Ultimate Edition",
    "page":217,
    "type":"",
    "usage":["Debuff.png", "Offensive.png"],
	"save":"",
	"description":""
  },
  {
    "invocationName":"Dragon Fire",
    "level":9,
    "cost":"40",
    "range":"100 feet",
    "duration":"0.25 minutes",
    "source":"Rifts Ultimate Edition",
    "page":217,
    "type":"",
    "usage":["Offensive.png"],
	"save":"",
	"description":""
  },
  {
    "invocationName":"Familiar Link",
    "level":9,
    "cost":"55",
    "range":"Self",
    "duration":"Permanent",
    "source":"Rifts Ultimate Edition",
    "page":217,
    "type":"",
    "usage":["Utility.png"],
	"save":"",
	"description":""
  },
  {
    "invocationName":"Mute",
    "level":9,
    "cost":"50",
    "range":"30 feet",
    "duration":"5 minutes",
    "source":"Rifts Ultimate Edition",
    "page":218,
    "type":"",
    "usage":["Debuff.png"],
	"save":"",
	"description":""
  },
  {
    "invocationName":"Protection Circle (Simple)",
    "level":9,
    "cost":"45",
    "range":"Special",
    "duration":"1440 minutes",
    "source":"Rifts Ultimate Edition",
    "page":218,
    "type":"",
    "usage":["Defensive.png"],
	"save":"",
	"description":""
  },
  {
    "invocationName":"Speed of the Snail",
    "level":9,
    "cost":"50",
    "range":"60 feet",
    "duration":"0.5 minutes",
    "source":"Rifts Ultimate Edition",
    "page":218,
    "type":"",
    "usage":["Debuff.png"],
	"save":"",
	"description":""
  },
  {
    "invocationName":"Summon and Control Canine",
    "level":9,
    "cost":"50",
    "range":"Special",
    "duration":"",
    "source":"Rifts Ultimate Edition",
    "page":218,
    "type":"",
    "usage":[""],
	"save":"",
	"description":""
  },
  {
    "invocationName":"Wall of Defense",
    "level":9,
    "cost":"55",
    "range":"100 feet",
    "duration":"0.25 minutes",
    "source":"Rifts Ultimate Edition",
    "page":218,
    "type":"",
    "usage":["Defensive.png", "Utility.png"],
	"save":"",
	"description":""
  },
  {
    "invocationName":"Water to Wine",
    "level":9,
    "cost":"40",
    "range":"12 feet",
    "duration":"Instant",
    "source":"Rifts Ultimate Edition",
    "page":218,
    "type":"",
    "usage":["Utility.png"],
	"save":"",
	"description":""
  },
  {
    "invocationName":"Banishment",
    "level":10,
    "cost":"65",
    "range":"100 feet",
    "duration":"20160 minutes",
    "source":"Rifts Ultimate Edition",
    "page":218,
    "type":"",
    "usage":["Defensive.png", "Utility.png"],
	"save":"",
	"description":""
  },
  {
    "invocationName":"Control Enslave Entity",
    "level":10,
    "cost":"80",
    "range":"30 feet",
    "duration":"2880 minutes",
    "source":"Rifts Ultimate Edition",
    "page":218,
    "type":"",
    "usage":["Utility.png"],
	"save":"",
	"description":""
  },
  {
    "invocationName":"Deathword",
    "level":10,
    "cost":"70",
    "range":"30 feet",
    "duration":"Instant",
    "source":"Rifts Ultimate Edition",
    "page":219,
    "type":"",
    "usage":["Offensive.png"],
	"save":"",
	"description":""
  },
  {
    "invocationName":"Giant",
    "level":10,
    "cost":"80",
    "range":"Touch",
    "duration":"0.25 minutes",
    "source":"Rifts Ultimate Edition",
    "page":219,
    "type":"",
    "usage":["Buff.png", "Utility.png"],
	"save":"",
	"description":""
  },
  {
    "invocationName":"Metamorphosis (Superior)",
    "level":10,
    "cost":"100",
    "range":"Self",
    "duration":"20 minutes",
    "source":"Rifts Ultimate Edition",
    "page":219,
    "type":"",
    "usage":["Utility.png"],
	"save":"",
	"description":""
  },
  {
    "invocationName":"Meteor",
    "level":10,
    "cost":"75",
    "range":"200 feet",
    "duration":"Instant",
    "source":"Rifts Ultimate Edition",
    "page":219,
    "type":"",
    "usage":["Offensive.png"],
	"save":"",
	"description":""
  },
  {
    "invocationName":"Mystic Portal",
    "level":10,
    "cost":"60",
    "range":"20 feet",
    "duration":"1 minutes",
    "source":"Rifts Ultimate Edition",
    "page":219,
    "type":"",
    "usage":["Utility.png"],
	"save":"",
	"description":""
  },
  {
    "invocationName":"Plane Skip",
    "level":10,
    "cost":"65",
    "range":"Touch",
    "duration":"Instant",
    "source":"Rifts Ultimate Edition",
    "page":220,
    "type":"",
    "usage":["Utility.png"],
	"save":"",
	"description":""
  },
  {
    "invocationName":"Speed Weapon",
    "level":10,
    "cost":"100",
    "range":"Touch",
    "duration":"0.25 minutes",
    "source":"Rifts Ultimate Edition",
    "page":220,
    "type":"",
    "usage":["Buff.png"],
	"save":"",
	"description":""
  },
  {
    "invocationName":"Summon Control Rodents",
    "level":10,
    "cost":"70",
    "range":"600 feet",
    "duration":"300 minutes",
    "source":"Rifts Ultimate Edition",
    "page":220,
    "type":"",
    "usage":["Offensive.png", "Utility.png"],
	"save":"",
	"description":""
  },
  {
    "invocationName":"Summon Shadow Beast",
    "level":10,
    "cost":"140",
    "range":"Special",
    "duration":"Varies",
    "source":"Rifts Ultimate Edition",
    "page":220,
    "type":"",
    "usage":["Offensive.png", "Utility.png"],
	"save":"",
	"description":""
  },
  {
    "invocationName":"Super-Healing",
    "level":10,
    "cost":"70",
    "range":"Touch",
    "duration":"Instant",
    "source":"Rifts Ultimate Edition",
    "page":221,
    "type":"",
    "usage":["Healing.png"],
	"save":"",
	"description":""
  },
  {
    "invocationName":"Anti-Magic Cloud",
    "level":11,
    "cost":"140",
    "range":"100 feet",
    "duration":"5 minutes",
    "source":"Rifts Ultimate Edition",
    "page":221,
    "type":"",
    "usage":["Debuff.png", "Utility.png"],
	"save":"",
	"description":""
  },
  {
    "invocationName":"Create Mummy",
    "level":11,
    "cost":"160",
    "range":"Touch",
    "duration":"Permanent",
    "source":"Rifts Ultimate Edition",
    "page":221,
    "type":"",
    "usage":["Utility.png"],
	"save":"",
	"description":""
  },
  {
    "invocationName":"Firequake",
    "level":11,
    "cost":"160",
    "range":"500 feet",
    "duration":"100 minutes",
    "source":"Rifts Ultimate Edition",
    "page":222,
    "type":"",
    "usage":["Offensive.png"],
	"save":"",
	"description":""
  },
  {
    "invocationName":"Remove Curse",
    "level":11,
    "cost":"140",
    "range":"10 feet",
    "duration":"Instant",
    "source":"Rifts Ultimate Edition",
    "page":222,
    "type":"",
    "usage":["Healing.png"],
	"save":"",
	"description":""
  },
  {
    "invocationName":"Re-Open Gateway",
    "level":11,
    "cost":"180",
    "range":"10 feet",
    "duration":"0.25 minutes",
    "source":"Rifts Ultimate Edition",
    "page":222,
    "type":"",
    "usage":["Utility.png"],
	"save":"",
	"description":""
  },
  {
    "invocationName":"Rift Teleportation",
    "level":11,
    "cost":"200",
    "range":"100 miles",
    "duration":"Varies",
    "source":"Rifts Ultimate Edition",
    "page":222,
    "type":"",
    "usage":["Utility.png"],
	"save":"",
	"description":""
  },
  {
    "invocationName":"Amulet",
    "level":12,
    "cost":"290",
    "range":"Special",
    "duration":"Permanent",
    "source":"Rifts Ultimate Edition",
    "page":223,
    "type":"",
    "usage":["Buff.png","Utility.png"],
	"save":"",
	"description":""
  },
  {
    "invocationName":"Calm Storms",
    "level":12,
    "cost":"200",
    "range":"Instant",
    "duration":"60 minutes",
    "source":"Rifts Ultimate Edition",
    "page":223,
    "type":"",
    "usage":["Utility.png"],
	"save":"",
	"description":""
  },
  {
    "invocationName":"Create Zombies",
    "level":12,
    "cost":"250",
    "range":"Touch",
    "duration":"Permanent",
    "source":"Rifts Ultimate Edition",
    "page":223,
    "type":"",
    "usage":["Utility.png"],
	"save":"",
	"description":""
  },
  {
    "invocationName":"Ensorcel",
    "level":12,
    "cost":"400",
    "range":"Touch",
    "duration":"20 minutes",
    "source":"Rifts Ultimate Edition",
    "page":223,
    "type":"",
    "usage":["Utility.png"],
	"save":"",
	"description":""
  },
  {
    "invocationName":"Summon and Control Entity",
    "level":12,
    "cost":"250",
    "range":"Special",
    "duration":"1440 minutes",
    "source":"Rifts Ultimate Edition",
    "page":224,
    "type":"",
    "usage":["Utility.png"],
	"save":"",
	"description":""
  },
  {
    "invocationName":"Protection Circle (Superior)",
    "level":13,
    "cost":"300",
    "range":"Special",
    "duration":"1440 minutes",
    "source":"Rifts Ultimate Edition",
    "page":224,
    "type":"",
    "usage":["Defensive.png"],
	"save":"",
	"description":""
  },
  {
    "invocationName":"Sanctum",
    "level":13,
    "cost":"390",
    "range":"Special",
    "duration":"Special",
    "source":"Rifts Ultimate Edition",
    "page":224,
    "type":"",
    "usage":["Utility.png"],
	"save":"",
	"description":""
  },
  {
    "invocationName":"Close Rift",
    "level":14,
    "cost":"200",
    "range":"100 feet",
    "duration":"Instant",
    "source":"Rifts Ultimate Edition",
    "page":224,
    "type":"",
    "usage":["Utility.png"],
	"save":"",
	"description":""
  },
  {
    "invocationName":"Restoration",
    "level":14,
    "cost":"750",
    "range":"3 feet",
    "duration":"Instant",
    "source":"Rifts Ultimate Edition",
    "page":224,
    "type":"",
    "usage":["Healing.png"],
	"save":"",
	"description":""
  },
  {
    "invocationName":"Resurrection",
    "level":14,
    "cost":"650",
    "range":"6 feet",
    "duration":"Instant",
    "source":"Rifts Ultimate Edition",
    "page":224,
    "type":"",
    "usage":["Healing.png"],
	"save":"",
	"description":""
  },
  {
    "invocationName":"Dimensional Portal",
    "level":15,
    "cost":"1000",
    "range":"3 feet",
    "duration":"0.5 minutes",
    "source":"Rifts Ultimate Edition",
    "page":225,
    "type":"",
    "usage"":["Utility.png"],
	"save":"",
	"description":"
  },
  {
    "invocationName":"Teleport (Superior)",
    "level":15,
    "cost":"600",
    "range":"Special",
    "duration":"Special",
    "source":"Rifts Ultimate Edition",
    "page":225,
    "type":"",
    "usage":["Utility.png"],
	"description":""
  }
]
